
export default class MockData{

    static houseData = {
        type: "FeatureCollection",
        features: [
            {
                type: "Feature",
                properties: {
                    id: 1,
                    name: "Дом 1",
                    stage: 1 
                },
                geometry: {
                    type: "Polygon",
                    coordinates: [
                        [
                            [55.54595382729156, 37.4965692912801],
                            [55.54560966093355, 37.49616603754906],
                            [55.54520414859523, 37.49630536624963],
                            [55.54517843229387, 37.49607216360187],
                            [55.54558389407524, 37.49593274506978],
                            [55.545684267836364, 37.49596804886044],
                            [55.54602833189789, 37.49637139242301],
                            [55.54595382729156, 37.4965692912801]                            
                        ]
                    ]
                }
            },
            {
                type: "Feature",
                properties: {
                    id: 2,
                    name: "Дом 2",
                    stage: 1 
                },
                geometry: {
                    type: "Polygon",
                    coordinates: [
                        [
                            [55.54432114485684, 37.4957522735292], 
                            [55.54415352742603, 37.4956036921812], 
                            [55.544079425859806, 37.49520933177147], 
                            [55.54420724843301, 37.49513459193984], 
                            [55.54426371385885, 37.49543543772849], 
                            [55.544331817864915, 37.495495804515585], 
                            [55.544928790169934, 37.49514779717451], 
                            [55.544971074940875, 37.49537336414235], 
                            [55.54432114485684, 37.4957522735292]
                        ]
                    ]
                }
            },
            {
                type: "Feature",
                properties: {
                    id: 3,
                    name: "Дом 3",
                    stage: 1 
                },
                geometry: {
                    type: "Polygon",
                    coordinates: [
                        [
                            [55.54480117323568, 37.494467233515266], 
                            [55.54487522261835, 37.494861504093464], 
                            [55.5447473005704, 37.4949362439251], 
                            [55.544690886662515, 37.49463539813645], 
                            [55.544622732455004, 37.49457512118089], 
                            [55.544025755502396, 37.49492357767959], 
                            [55.54398352053895, 37.49469792088023], 
                            [55.54463320208741, 37.49431865216727], 
                            [55.54480117323568, 37.494467233515266]]
                    ]
                }
            },
            {
                type: "Feature",
                properties: {
                    id: 4,
                    name: "Дом 4",
                    stage: 1 
                },
                geometry: {
                    type: "Polygon",
                    coordinates: [
                        [
                            [55.545377199553315, 37.493382607641216], 
                            [55.54531240082562, 37.49336158706357], 
                            [55.545263407834334, 37.493321971359535], 
                            [55.54519891385541, 37.49321192773723], 
                            [55.545174823878696, 37.493126857279826], 
                            [55.54516089844238, 37.493005764379525], 
                            [55.54516664141489, 37.492847660889524], 
                            [55.54518890177827, 37.49273132906023], 
                            [55.54523860637978, 37.49259936654499], 
                            [55.54535087349486, 37.49273087990259], 
                            [55.545301118212706, 37.49286284241782], 
                            [55.54529542608244, 37.4930208560763], 
                            [55.54531946516269, 37.49310592653371], 
                            [55.54536850890662, 37.49314554223774], 
                            [55.54601389854724, 37.49307197021597], 
                            [55.546022589051255, 37.49330912545098], 
                            [55.545377199553315, 37.493382607641216]
                        ]
                    ]
                }
            },
            {
                type: "Feature",
                properties: {
                    id: 5,
                    name: "Дом 5",
                    stage: 1 
                },
                geometry: {
                    type: "Polygon",
                    coordinates: [
                        [
                            [55.54578052476198, 37.49717969651566], 
                            [55.54568253988517, 37.497188050847804],
                            [55.54522280052661, 37.49691505283296], 
                            [55.54526584732083, 37.496689845191234], 
                            [55.54572548453188, 37.49696275337455], 
                            [55.546151828308126, 37.49662633430064], 
                            [55.5462069187627, 37.49684318761023], 
                            [55.54578052476198, 37.49717969651566]
                        ]
                    ]
                }
            },
            {
                type: "Feature",
                properties: {
                    id: 6,
                    name: "Дом 6",
                    stage: 1 
                },
                geometry: {
                    type: "Polygon",
                    coordinates: [
                        [
                            [55.54480117323568, 37.494467233515266], 
                            [55.54487522261835, 37.494861504093464], 
                            [55.5447473005704, 37.4949362439251], 
                            [55.544690886662515, 37.49463539813645], 
                            [55.544622732455004, 37.49457512118089], 
                            [55.544025755502396, 37.49492357767959], 
                            [55.54398352053895, 37.49469792088023], 
                            [55.54463320208741, 37.49431865216727], 
                            [55.54480117323568, 37.494467233515266]]
                    ]
                }
            },
            {
                type: "Feature",
                properties: {
                    id: 7,
                    name: "Дом 7",
                    stage: 1 
                },
                geometry: {
                    type: "Polygon",
                    coordinates: [
                        [
                            [55.545614641507775, 37.49500379723447], 
                            [55.54552814205771, 37.49510557635615], 
                            [55.54515784907611, 37.49523277780039], 
                            [55.54513208192164, 37.4949994853211], 
                            [55.54550237514597, 37.49487228387687], 
                            [55.54576085665537, 37.494186150662856], 
                            [55.54587312227899, 37.49431775385199], 
                            [55.545614641507775, 37.49500379723447]
                        ]
                    ]
                }
            },
            {
                type: "Feature",
                properties: {
                    id: 8,
                    name: "Дом 8",
                    stage: 1 
                },
                geometry: {
                    type: "Polygon",
                    coordinates: [
                        [
                            [55.54478638367172, 37.48655550131344], 
                            [55.54468971772482, 37.48609529439338], 
                            [55.54481601361731, 37.48601273921877], 
                            [55.54495953811485, 37.48669599782387], 
                            [55.544462434919566, 37.487019840483796], 
                            [55.54441567711329, 37.48679696846181], 
                            [55.54478638367172, 37.48655550131344]
                        ]
                    ]
                }
            },
            {
                type: "Feature",
                properties: {
                    id: 8,
                    name: "Дом 8",
                    stage: 1 
                },
                geometry: {
                    type: "Polygon",
                    coordinates: [
                        [
                            [55.543926241520836, 37.48706610372093], 
                            [55.54405264151447, 37.48698363837785], 
                            [55.54406194234234, 37.48702828464747], 
                            [55.544179854286305, 37.48695111936456], 
                            [55.54422661237306, 37.487173901555025],
                            [55.54398240240453, 37.48733353218101], 
                            [55.543926241520836, 37.48706610372093]
                        ]
                    ]
                }
            },
            {
                type: "Feature",
                properties: {
                    id: 8,
                    name: "Дом 8",
                    stage: 1 
                },
                geometry: {
                    type: "Polygon",
                    coordinates: [
                        [
                            [55.54422661237306, 37.487173901555025], 
                            [55.544179854286305, 37.48695111936456], 
                            [55.54441567711329, 37.48679696846181], 
                            [55.544462434919566, 37.487019840483796], 
                            [55.54422661237306, 37.487173901555025]
                        ]
                    ]
                }
            },
            {
                type: "Feature",
                properties: {
                    id: 8,
                    name: "Дом 8",
                    stage: 1 
                },
                geometry: {
                    type: "Polygon",
                    coordinates: [
                        [
                            [55.54405264151447, 37.48698363837785], 
                            [55.543926241520836, 37.48706610372093], 
                            [55.54383887433958, 37.486650273575904],
                            [55.5439652237898, 37.4865677184013], 
                            [55.54405264151447, 37.48698363837785]
                        ]
                    ]
                }
            },
        ]
    }

    static streetData = {
        type: "FeatureCollection",
        features: [
            {   
                type: "Feature",
                properties: {
                    id: 1,
                    stage: 1,
                    name: 'улица 1',
                },
                geometry: {
                    type: "LineString",
                    coordinates: [
                        [55.54190678514382, 37.478647721698856], 
                        [55.54185143452785, 37.47838496447825]
                    ]
                }
            },
            {   
                type: "Feature",
                properties: {
                    id: 2,
                    stage: 1,
                    name: 'улица 1',
                },
                geometry: {
                    type: "LineString",
                    coordinates: [
                        [55.54179654127802, 37.47812418355127], 
                        [55.541914612497365, 37.47796266646319]
                    ]
                }
            },
            {   
                type: "Feature",
                properties: {
                    id: 3,
                    stage: 1,
                    name: 'улица 1',
                },
                geometry: {
                    type: "LineString",
                    coordinates: [
                        [55.54190678514382, 37.478647721698856],
                        [55.54205814758739, 37.47936673325227]
                    ]
                }
            },
            {   
                type: "Feature",
                properties: {
                    id: 4,
                    stage: 1,
                    name: 'улица 1',
                },
                geometry: {
                    type: "LineString",
                    coordinates:  [
                        [55.54283634872131, 37.47670161146734], 
                        [55.542975306143035, 37.47651152795323], 
                        [55.54302486106672, 37.47642457103372]
                    ]
                }
            },
            {   
                type: "Feature",
                properties: {
                    id: 5,
                    stage: 1,
                    name: 'улица 1',
                },
                geometry: {
                    type: "LineString",
                    coordinates: [
                        [55.543801365856645, 37.48765135612853], 
                        [55.54361651661786, 37.48677118681315]
                    ]
                }
            },
            {   
                type: "Feature",
                properties: {
                    id: 6,
                    stage: 1,
                    name: 'улица 1',
                },
                geometry: {
                    type: "LineString",
                    coordinates: [
                        [55.543936152270845, 37.48756332123069], 
                        [55.54398626505059, 37.487530622554345]
                    ]
                }
            },
            {   
                type: "Feature",
                properties: {
                    id: 7,
                    stage: 1,
                    name: 'улица 1',
                },
                geometry: {
                    type: "LineString",
                    coordinates: [
                        [55.54332798336339, 37.485397483080675], 
                        [55.5433065859741, 37.48529516496982]
                    ]
                }
            },
            {   
                type: "Feature",
                properties: {
                    id: 8,
                    stage: 1,
                    name: 'улица 1',
                },
                geometry: {
                    type: "LineString",
                    coordinates: [
                        [55.54486221189272, 37.485919943249925], 
                        [55.544795989265445, 37.48560382610144]
                    ]
                }
            },
            {   
                type: "Feature",
                properties: {
                    id: 9,
                    stage: 1,
                    name: 'улица 1',
                },
                geometry: {
                    type: "LineString",
                    coordinates: [
                        [55.543801365856645, 37.48765135612853], 
                        [55.54407973080482, 37.48897673049873]
                    ]
                }
            },
            {   
                type: "Feature",
                properties: {
                    id: 10,
                    stage: 1,
                    name: 'улица 1',
                },
                geometry: {
                    type: "LineString",
                    coordinates: [
                        [55.54421456708863, 37.48888905492699], 
                        [55.544119780228016, 37.488437741328255]
                    ]
                }
            }
        ]
    }

    static subwayExits = {
        type: "FeatureCollection",
        features: [
            {   
                type: "Feature",
                properties: {
                    id: 1,
                    stage: 1,
                    name: 'Выход 1',
                },
                geometry: {
                    type: "Point",
                    coordinates: [55.55357355512132, 37.49579152990711],   
                }
            },
            {   
                type: "Feature",
                properties: {
                    id: 2,
                    stage: 1,
                    name: 'Выход 2',
                },
                geometry: {
                    type: "Point",
                    coordinates: [55.5535969793969, 37.4968200110759],
                }
            },
            {   
                type: "Feature",
                properties: {
                    id: 4,
                    stage: 1,
                    name: 'Выход 4',
                },
                geometry: {
                    type: "Point",
                    coordinates: [55.55205907747738, 37.49652203989616],
                }
            },
            {   
                type: "Feature",
                properties: {
                    id: 3,
                    stage: 1,
                    name: 'Выход 3',
                },
                geometry: {
                    type: "Point",
                    coordinates: [55.55201187138158, 37.49546517196439],
                }
            },
            {   
                type: "Feature",
                properties: {
                    id: 5,
                    stage: 1,
                    name: 'Выход 5',
                },
                geometry: {
                    type: "Point",
                    coordinates: [55.5518380874187, 37.49107205089893],
                }
            },
            {   
                type: "Feature",
                properties: {
                    id: 6,
                    stage: 1,
                    name: 'Выход 6',
                },
                geometry: {
                    type: "Point",
                    coordinates: [55.55354510045108, 37.49066179030868],
                }
            },
            {   
                type: "Feature",
                properties: {
                    id: 7,
                    stage: 1,
                    name: 'Выход 7',
                },
                geometry: {
                    type: "Point",
                    coordinates: [55.553571725893136, 37.48997790288288],
                }
            },
        ]
    }

    static busStations = {
        type: "FeatureCollection",
        features: [
            {   
                type: "Feature",
                properties: {
                    id: 1,
                    stage: 1,
                    name: 'д. Дудкино',
                },
                geometry: {
                    type: "Point",
                    coordinates: [55.635565394112945, 37.453448361011795],
                }
            },
            {   
                type: "Feature",
                properties: {
                    id: 2,
                    stage: 1,
                    name: 'Академика Семёнова',
                },
                geometry: {
                    type: "Point",
                    coordinates: [55.543594916086434, 37.50908390116623],
                }
            },
            {   
                type: "Feature",
                properties: {
                    id: 3,
                    stage: 1,
                    name: 'СНТ Гавриково-1',
                },
                geometry: {
                    type: "Point",
                    coordinates:  [55.541623372903416, 37.502625643094106],
                }
            },
            {   
                type: "Feature",
                properties: {
                    id: 4,
                    stage: 1,
                    name: 'СНТ Берёзка-Коммунарка-1',
                },
                geometry: {
                    type: "Point",
                    coordinates: [55.55831193574257, 37.48954464542134],
                }
            },
            {   
                type: "Feature",
                properties: {
                    id: 5,
                    stage: 1,
                    name: 'СНТ Берёзка-Коммунарка-1',
                },
                geometry: {
                    type: "Point",
                    coordinates: [55.55944752981669, 37.48877739433718],
                }
            },
            {   
                type: "Feature",
                properties: {
                    id: 6,
                    stage: 1,
                    name: 'СНТ Юннат-2 (по требованию)',
                },
                geometry: {
                    type: "Point",
                    coordinates: [55.54810672988316, 37.486526575561285],
                }
            },
            {   
                type: "Feature",
                properties: {
                    id: 7,
                    stage: 1,
                    name: 'СНТ Юннат-2 (по требованию)	',
                },
                geometry: {
                    type: "Point",
                    coordinates: [55.54706279292824, 37.48700358097716],
                }
            },
            {   
                type: "Feature",
                properties: {
                    id: 8,
                    stage: 1,
                    name: 'Микрорайон Бутовские аллеи',
                },
                geometry: {
                    type: "Point",
                    coordinates: [55.54234206495791, 37.4893250971659],
                }
            },
            {   
                type: "Feature",
                properties: {
                    id: 9,
                    stage: 1,
                    name: 'Микрорайон Бутовские аллеи',
                },
                geometry: {
                    type: "Point",
                    coordinates: [55.54357982111979, 37.489448705349],
                }
            },
        ]
    }
}